# Data Loading and Preparation

In [6]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Reading and Writing Data in Text Format

In [7]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [8]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
pd.read_csv('examples/ex1.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [19]:

!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [21]:
df = pd.read_csv('examples/ex2.csv')
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

### Reading Text Files in Pieces

In [8]:
pd.options.display.max_rows = 10

In [9]:
result = pd.read_csv('examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [10]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

### Writing Data to Text Format

In [11]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
data.to_csv('examples/out.csv')
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [13]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

## Handling Missing Data

In [16]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [17]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [18]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [19]:
# [QUIZ] drop the rows which has NA
# (1) dropna
# (2) notnull
# (3) isnull
# (4) others...
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data.dropna?

In [20]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [21]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data.isnull?

In [22]:
data[~data.isnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data.notnull?

In [24]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [25]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [26]:
data[~data.isnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

### Filling In Missing Data

In [26]:
df = pd.Series([1, NA, 3.5, NA, 7])
df

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [ ]:
# fill the NA values to 0
# (1) fillna 
# (2) inplace=True

In [23]:
df.fillna(0)

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [24]:
df.fillna(0, inplace=True)
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

## Data Transformation

### Removing Duplicates

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# Remove duplicate rows 
# (1) based on all columns, 'k1' and 'k2'
# (2) based on 'k1' column
# [hint] drop_duplicate()
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

### Transforming Data Using a Function or Mapping

In [29]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [31]:
# add new column 'animal' representing the animal of food
# [hint] first, food name need to be lowercase  str.lower() or x.lower()
# [hint] data['food'].map
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [34]:
data['animal'] = lowercased.map(meat_to_animal)

In [35]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

    food	 ounces	animal
0	bacon	    4.0	pig
1	pulled pork	3.0	pig
2	bacon	   12.0	pig
3	Pastrami	6.0	cow
4	corned beef	7.5	cow
5	Bacon	    8.0	pig
6	pastrami	3.0	cow
7	honey ham	5.0	pig
8	nova lox	6.0	salmon

In [36]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()])

In [37]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
lowercase=data.food.str.lower()

In [39]:
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data['animal2']=lowercase.map(meat_to_animal)

In [41]:
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

### Replacing Values

In [42]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [43]:
# replace the value of -999 to np.nan
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

### Discretization and Binning

In [44]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

#### specified bins

In [45]:
bins = [10, 30, 40, 50, 100]
cats = pd.cut(ages, bins)
cats

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], ..., (30, 40], (50, 100], (40, 50], (40, 50], (30, 40]]
Length: 12
Categories (4, interval[int64]): [(10, 30] < (30, 40] < (40, 50] < (50, 100]]

In [46]:
cats.codes

array([0, 0, 0, 0, 0, 0, 1, 1, 3, 2, 2, 1], dtype=int8)

In [47]:
pd.value_counts(cats)

(10, 30]     6
(30, 40]     3
(40, 50]     2
(50, 100]    1
dtype: int64

#### specifying the number of bins

In [48]:
cats = pd.cut(ages, 4)
pd.value_counts(cats)

(19.959, 30.25]    6
(30.25, 40.5]      3
(40.5, 50.75]      2
(50.75, 61.0]      1
dtype: int64

#### Quantile-based discretization function.

In [58]:
cats = pd.qcut(ages, 4)
pd.value_counts(cats)

(38.0, 61.0]       3
(29.0, 38.0]       3
(22.75, 29.0]      3
(19.999, 22.75]    3
dtype: int64

In [ ]:
# [Quiz]
# make new column based on quntile-bins of ounces
# [hint] pd.qcut( ,3)
# new_cat = pd.qcut(data['ounces'], 3)
# new_cat.cat.codes

    food     ounces	ounces_category
0	bacon	    4.0	    0
1	pulled pork	3.0	    0
2	bacon	   12.0	    2
3	Pastrami	6.0	    1
4	corned beef	7.5	    2
5	Bacon	    8.0	    2
6	pastrami	3.0	    0
7	honey ham	5.0	    1
8	nova lox	6.0	    1

In [59]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

### Permutation and Random Sampling

In [49]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [50]:
sampler = np.random.permutation(5)
sampler

array([0, 4, 3, 1, 2])

In [51]:
# sample reordering by random.permutation
# [hint] take(sampler) or iloc

In [52]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [53]:
df.iloc[sampler]

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [54]:
# sampling n=3

### Computing Indicator/Dummy Variables

In [55]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [56]:
df.key

0    b
1    b
2    a
3    c
4    a
5    b
Name: key, dtype: object

In [57]:
dummies=pd.get_dummies(df.key)
dummies

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [58]:
# make the below DataFrame with data1, new columns with key
# [hint] pd.get_dummies()
# [hint] df[['data1']].join(dummies)

data1	a	b	c
0	0	0	1	0
1	1	0	1	0
2	2	1	0	0
3	3	0	0	1
4	4	1	0	0
5	5	0	1	0

## String Manipulation

### Vectorized String Functions in pandas

In [59]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [60]:
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [61]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object